articles/offlineimap_mu4e.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-09-20 Tue 18:46 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Using Offlineimap + MU4E to Setup A Powerful Email Client</title>
<meta name="author" content="Ilghar Kus" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Using Offlineimap + MU4E to Setup A Powerful Email Client</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org72692e4">1. Introduction</a></li>
<li><a href="#org911ac53">2. Setup guide: OfflineIMAP</a>
<ul>
<li><a href="#org02a13e6">2.1. Installation</a></li>
<li><a href="#org4368198">2.2. Configuration</a>
<ul>
<li><a href="#orgeee4a3c">2.2.1. [general]</a></li>
<li><a href="#org1786ce4">2.2.2. [mbnames]</a></li>
<li><a href="#orgdfca2ac">2.2.3. [Account example]</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<blockquote>
<p>
&lt;ika&gt; if i haven't fallen into the fucking rabbithole of emacs
</p>

<p>
&lt;ika&gt; who knows
</p>

<p>
&lt;ika&gt; maybe ill go use mutt
</p>
</blockquote>

<div id="outline-container-org72692e4" class="outline-2">
<h2 id="org72692e4"><span class="section-number-2">1.</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
<a href="https://github.com/OfflineIMAP/offlineimap3">OfflineIMAP</a> is an email syncing software that downloads your emails from the
remote ESP servers as an local directory, and will synchronize both sides
using IMAP protocol. You can use OfflineIMAP to setup multiple accounts with
their own local mail directory, remote host, refresh rate, filter, hooks, etc.
It's also extensible using Python, so you could automatically play your
favourite true crime podcast episode everytime you get a new email.
</p>

<p>
Mu4e is a mail client for emacs, shipped with Mu as a mail indexer and searcher
to deal with your various maildirs and mail files. It's fully documented,
asynchronous, support encryption, flow-optimized interface, and extensible,
using Elisp of course.
</p>

<p>
With OfflineIMAP as a backend synchronizer, and mu4e as a front-end interface
and searcher, you could have a consistent, customized and fast experience
dealing with emails, in your own and beloved text editor, and you won't ever
need to suffer 30mins of 5000rpm fan noize of compiling thunderbird to update
some feature you never use. (If you don't use Gentoo, at least we could agree
on the part that Thunderbird is totally bloatware.)
</p>
</div>
</div>

<div id="outline-container-org911ac53" class="outline-2">
<h2 id="org911ac53"><span class="section-number-2">2.</span> Setup guide: OfflineIMAP</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org02a13e6" class="outline-3">
<h3 id="org02a13e6"><span class="section-number-3">2.1.</span> Installation</h3>
<div class="outline-text-3" id="text-2-1">
<p>
If you have the offlineimap package in your distro repo and it's written in python3
(python2 version is obsolete and archived, don't use that, either the package or
the language), you could just download and install it using the package manager
that came with the distro.
</p>

<p>
If you're using Gentoo, however, the <code>offlineimap</code> package is not included in the
<code>gentoo</code> repo, so unless you wrote your own ebuild file or you find one in other
people's overlay, you have to download the code from the <a href="https://github.com/OfflineIMAP/offlineimap3">GitHub repo</a>.
</p>

<p>
Clone the repo using <code>git</code>:
</p>

<div class="org-src-container">
<pre class="src src-sh">$ git clone https://github.com/OfflineIMAP/offlineimap3
</pre>
</div>

<p>
Then create a symbolic link of it to dir <code>~/.local/bin/</code>
</p>

<div class="org-src-container">
<pre class="src src-sh">$ ln -s /path/to/offlineimap3/offlineimap.py ${<span style="color: #00bcff;">HOME</span>}/.local/bin/offlineimap
</pre>
</div>

<p>
Then you're good to go.
</p>
</div>
</div>

<div id="outline-container-org4368198" class="outline-3">
<h3 id="org4368198"><span class="section-number-3">2.2.</span> Configuration</h3>
<div class="outline-text-3" id="text-2-2">
<p>
The configutaion file have a default path of <code>~/.offlineimaprc</code>, and in the cloned
repo you could find a <code>offlineimap.conf</code> file and a <code>offlineimap.conf.minimal</code> file.
</p>

<p>
The first file is a detailed documentation with all the options, explainations
and usage given, although the method of documentation in config files as comment
lines was always spurned by me, this file by it self is written as an exellent
document.
</p>
</div>

<div id="outline-container-orgeee4a3c" class="outline-4">
<h4 id="orgeee4a3c"><span class="section-number-4">2.2.1.</span> [general]</h4>
<div class="outline-text-4" id="text-2-2-1">
<p>
<code>general</code> segment is used to declare accounts, the python extension file, and
other options related to the overall program-running and syncing mechanism.
</p>

<p>
For the example below i'll use a test account <code>example@example.com</code>. And be aware
that I won't demonstrate any other options provided by the program than the ones
that my configuration file is using right now, so it is recommended to peruse
the example config file if you want to use other features.
</p>

<div class="org-src-container">
<pre class="src src-python">[general]
<span style="color: #00bcff;">accounts</span> = example
<span style="color: #00bcff;">pythonfile</span> = ~/.offlineimap_ext.py
<span style="color: #00bcff;">maxsyncaccounts</span> = 1
</pre>
</div>

<p>
<code>accounts</code> is the part that you declare all your accounts, seperated by comma.
The name you used here do not have to be your username at your ESP or your
email account. It's just needed for account settings later in the config file.
</p>

<p>
<code>pythonfile</code> is used to declare the python program you use to extend the program
capability. It's imported and interpreted during parsing the config file,
before running any core mechanism. You can basically use this to do anything
you want, in my case it's used for extracting passwords from gpg encrypted files.
</p>

<p>
<code>maxsyncaccounts</code> is used to specify the max amount of concurrent syncing, the
developers and I both recommend this amount to be one, whether you decide to run
multiple offlineimap instances for multiple accounts or using one instance for all
accounts. The reason is that later in the section of post-sync hook, we need to
call <code>mu</code> to index the mail directory for changes, and it cannot be ran concurrently
with multiple instances.
</p>

<p>
And in the next-next section you need to declare the account-specific settings.
</p>
</div>
</div>

<div id="outline-container-org1786ce4" class="outline-4">
<h4 id="org1786ce4"><span class="section-number-4">2.2.2.</span> [mbnames]</h4>
<div class="outline-text-4" id="text-2-2-2">
<p>
Mailbox name recording section, skipped cause I don't use it.
</p>
</div>
</div>

<div id="outline-container-orgdfca2ac" class="outline-4">
<h4 id="orgdfca2ac"><span class="section-number-4">2.2.3.</span> [Account example]</h4>
<div class="outline-text-4" id="text-2-2-3">
<p>
This part is for specifying, of course, account related settings.
</p>

<p>
First of all there's two repository that you need to specify,
a local one, and a remote one.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #00bcff;">localrepository</span> = LocalExample
<span style="color: #00bcff;">remoterepository</span> = RemoteExample
</pre>
</div>

<p>
The repo name in here doesn't need to match up with anything,
other than the name in the [Repository] section below.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #00bcff;">autorefresh</span> = 5
<span style="color: #00bcff;">quick</span> = 10
<span style="color: #00bcff;">postsynchook</span> = mu index
</pre>
</div>

<p>
Offlineimap could run indefinitely, as long as you don't kill it.
Such mechanism enables the feature of automatic syncing with the remote server,
specified in the <code>autorefresh</code> variable. The time here uses unit of minute, and
supports fractional values like 3.25.
</p>

<p>
If your system uses systemd, it's probably better to use the systemd timer
instead of this mechanism, for the sake of integrity and better system management.
</p>

<p>
Option <code>postsynchook</code> offers a feature to run a shell one-liner after the a sync.
Here the <code>mu</code> program is called to index the maildir.
</p>

<p>
You can also add a notification command here, such as <code>notify-send</code>,
to send a desktop popup, but given the condition that a mail sync
doesn't neccessarily mean new emails, you could save that for the later part.
</p>

<p>
Other Options such as <code>maxsize</code> for limited mailbox syncing, <code>maxage</code> for date-specified
mail syncing, etc. could be found in the doc.
</p>

<p>
<b>To be noticed</b>, if you're using Gmail there's a whole other category for gmail account
configuration, which is also documented in the <code>offlineimap.conf</code>.
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Ilghar Kus</p>
<p class="date">Created: 2022-09-20 Tue 18:46</p>
</div>
</body>
</html>
